
const productSections = {
    product1: [
      {
        name: 'محبس',
        description: 'يُستخدم عادة في مختلف الصناعات، بما في ذلك معالجة المياه، والنفط والغاز، والتصنيع، للتحكم في تدفق السوائل عبر أنبوب. تعمل الصمام عن طريق رفع بوابة من مسار السائل، مما يسمح بمرور واضح وغير معوق عندما يكون مفتوحًا بالكامل. يبدو أن هذا الصمام بنموذجه الثقيل والقوي مصمم خصيصًا لتطبيقات كبيرة الحجم.it is commonly used in various industries, including water treatment, oil and gas, and manufacturing, to control the flow of liquids through a pipeline. The valve operates by lifting a gate out of the path of the fluid, allowing for a clear, unobstructed passage when fully open. This particular valve appears to be a substantial, heavy-duty model designed for large-scale applications',
        price: 'x',
        imageUrl: '../../image/v1.jpg'
      },
      {
        name: 'محبس',
        description: "يُستخدم عادة في مختلف الصناعات، بما في ذلك معالجة المياه، والنفط والغاز، والتصنيع، للتحكم في تدفق السوائل عبر أنبوب. تعمل الصمام عن طريق رفع بوابة من مسار السائل، مما يسمح بمرور واضح وغير معوق عندما يكون مفتوحًا بالكامل. يبدو أن هذا الصمام بنموذجه الثقيل والقوي مصمم خصيصًا لتطبيقات كبيرة الحجم.",
        price: '$15',
        imageUrl: '../../image/v2.jpg'
      },
      {
        name: 'محبس 1',
        description: 'يُستخدم عادة في مختلف الصناعات، بما في ذلك معالجة المياه، والنفط والغاز، والتصنيع، للتحكم في تدفق السوائل عبر أنبوب. تعمل الصمام عن طريق رفع بوابة من مسار السائل، مما يسمح بمرور واضح وغير معوق عندما يكون مفتوحًا بالكامل. يبدو أن هذا الصمام بنموذجه الثقيل والقوي مصمم خصيصًا لتطبيقات كبيرة الحجم.',
        price: 'X',
        imageUrl: '../../image/v5.png'
      },
      {
        name: 'محبس 2',
        description: 'يُستخدم عادة في مختلف الصناعات، بما في ذلك معالجة المياه، والنفط والغاز، والتصنيع، للتحكم في تدفق السوائل عبر أنبوب. تعمل الصمام عن طريق رفع بوابة من مسار السائل، مما يسمح بمرور واضح وغير معوق عندما يكون مفتوحًا بالكامل. يبدو أن هذا الصمام بنموذجه الثقيل والقوي مصمم خصيصًا لتطبيقات كبيرة الحجم.',
        price: 'x',
        imageUrl: '../../image/v6.png'
      },
      {
        name: 'محبس 3',
        description: 'يُستخدم عادة في مختلف الصناعات، بما في ذلك معالجة المياه، والنفط والغاز، والتصنيع، للتحكم في تدفق السوائل عبر أنبوب. تعمل الصمام عن طريق رفع بوابة من مسار السائل، مما يسمح بمرور واضح وغير معوق عندما يكون مفتوحًا بالكامل. يبدو أن هذا الصمام بنموذجه الثقيل والقوي مصمم خصيصًا لتطبيقات كبيرة الحجم.',
        price: 'x',
        imageUrl: '../../image/v7.png'
      }
    ],
    product2: [
      {
        name: 'كوع',
        description: 'وصلة أنابيب تُستخدم لتغيير اتجاه التدفق داخل نظام الأنابيب. إليك بعض النقاط الرئيسية حول الانحناءات: ويمكن أن يكون لها نصف قطر كبير أو نصف قطر صغير، مما يؤثر على خصائص التدفق ويوفر الانحناء ذو نصف القطر الكبير تغييرًا أكثر سلاسة في الاتجاه ويقلل من فقدان الضغط مقارنةً بالانحناء ذو نصف القطر الصغير.',
        price: 'x',
        imageUrl: '../../image/f2.png'
      },
      {
        name: 'كوع 2',
        description: 'وصلة أنابيب تُستخدم لتغيير اتجاه التدفق داخل نظام الأنابيب. إليك بعض النقاط الرئيسية حول الانحناءات: ويمكن أن يكون لها نصف قطر كبير أو نصف قطر صغير، مما يؤثر على خصائص التدفق ويوفر الانحناء ذو نصف القطر الكبير تغييرًا أكثر سلاسة في الاتجاه ويقلل من فقدان الضغط مقارنةً بالانحناء ذو نصف القطر الصغير.',
        price: 'x',
        imageUrl: '../../image/f4.png'
      },
      {
        name: 'كوع 3',
        description: 'وصلة أنابيب تُستخدم لتغيير اتجاه التدفق داخل نظام الأنابيب. إليك بعض النقاط الرئيسية حول الانحناءات: ويمكن أن يكون لها نصف قطر كبير أو نصف قطر صغير، مما يؤثر على خصائص التدفق ويوفر الانحناء ذو نصف القطر الكبير تغييرًا أكثر سلاسة في الاتجاه ويقلل من فقدان الضغط مقارنةً بالانحناء ذو نصف القطر الصغير.',
        price: 'x',
        imageUrl: '../../image/f12.png'
      },
      {
        name: 'كوع 4',
        description: 'وصلة أنابيب تُستخدم لتغيير اتجاه التدفق داخل نظام الأنابيب. إليك بعض النقاط الرئيسية حول الانحناءات: ويمكن أن يكون لها نصف قطر كبير أو نصف قطر صغير، مما يؤثر على خصائص التدفق ويوفر الانحناء ذو نصف القطر الكبير تغييرًا أكثر سلاسة في الاتجاه ويقلل من فقدان الضغط مقارنةً بالانحناء ذو نصف القطر الصغير.',
        price: 'x',
        imageUrl: '../../image/f11.png'
      }
    ],
    product3: [
      {
        name: 'غطاء مربع',
        description: 'غطاء فتحة التفتيش هو صفيحة قابلة للإزالة تُشكِّل غطاءً لفتحة التفتيش، وهي نقطة الوصول إلى المرافق تحت الأرض مثل شبكات الصرف الصحي، ومصارف مياه الأمطار، والخزائن الكهربائية. يتم تصميمه لمنع سقوط أي شخص أو أي شيء داخل الفتحة ومنع الوصول غير المصرح به',
        price: 'X',
        imageUrl: '../../image/f7.png'
      },
      {
        name: 'غطاء',
        description: 'غطاء فتحة التفتيش هو صفيحة قابلة للإزالة تُشكِّل غطاءً لفتحة التفتيش، وهي نقطة الوصول إلى المرافق تحت الأرض مثل شبكات الصرف الصحي، ومصارف مياه الأمطار، والخزائن الكهربائية. يتم تصميمه لمنع سقوط أي شخص أو أي شيء داخل الفتحة ومنع الوصول غير المصرح به',
        price: 'X',
        imageUrl: '../../image/f9.png'
      },
      {
        name: 'غطاء 2',
        description: 'غطاء فتحة التفتيش هو صفيحة قابلة للإزالة تُشكِّل غطاءً لفتحة التفتيش، وهي نقطة الوصول إلى المرافق تحت الأرض مثل شبكات الصرف الصحي، ومصارف مياه الأمطار، والخزائن الكهربائية. يتم تصميمه لمنع سقوط أي شخص أو أي شيء داخل الفتحة ومنع الوصول غير المصرح به',
        price: 'X',
        imageUrl: '../../image/f10.png'
      },
      {
        name: 'غطاء 3',
        description: 'غطاء فتحة التفتيش هو صفيحة قابلة للإزالة تُشكِّل غطاءً لفتحة التفتيش، وهي نقطة الوصول إلى المرافق تحت الأرض مثل شبكات الصرف الصحي، ومصارف مياه الأمطار، والخزائن الكهربائية. يتم تصميمه لمنع سقوط أي شخص أو أي شيء داخل الفتحة ومنع الوصول غير المصرح به',
        price: 'X',
        imageUrl: '../../image/f15.png'
      },
      {
        name: 'غطاء 4',
        description: 'غطاء فتحة التفتيش هو صفيحة قابلة للإزالة تُشكِّل غطاءً لفتحة التفتيش، وهي نقطة الوصول إلى المرافق تحت الأرض مثل شبكات الصرف الصحي، ومصارف مياه الأمطار، والخزائن الكهربائية. يتم تصميمه لمنع سقوط أي شخص أو أي شيء داخل الفتحة ومنع الوصول غير المصرح به',
        price: 'X',
        imageUrl: '../../image/f16.png'
      },
      {
        name: 'غطاء 5',
        description: 'غطاء فتحة التفتيش هو صفيحة قابلة للإزالة تُشكِّل غطاءً لفتحة التفتيش، وهي نقطة الوصول إلى المرافق تحت الأرض مثل شبكات الصرف الصحي، ومصارف مياه الأمطار، والخزائن الكهربائية. يتم تصميمه لمنع سقوط أي شخص أو أي شيء داخل الفتحة ومنع الوصول غير المصرح به',
        price: 'X',
        imageUrl: '../../image/f17.png'
      },
      {
        name: 'غطاء 6',
        description: 'غطاء فتحة التفتيش هو صفيحة قابلة للإزالة تُشكِّل غطاءً لفتحة التفتيش، وهي نقطة الوصول إلى المرافق تحت الأرض مثل شبكات الصرف الصحي، ومصارف مياه الأمطار، والخزائن الكهربائية. يتم تصميمه لمنع سقوط أي شخص أو أي شيء داخل الفتحة ومنع الوصول غير المصرح به',
        price: 'X',
        imageUrl: '../../image/f18.png'
      },
      {
        name: 'غطاء 7',
        description: 'غطاء فتحة التفتيش هو صفيحة قابلة للإزالة تُشكِّل غطاءً لفتحة التفتيش، وهي نقطة الوصول إلى المرافق تحت الأرض مثل شبكات الصرف الصحي، ومصارف مياه الأمطار، والخزائن الكهربائية. يتم تصميمه لمنع سقوط أي شخص أو أي شيء داخل الفتحة ومنع الوصول غير المصرح به',
        price: 'X',
        imageUrl: '../../image/f19.png'
      },
      {
        name: 'غطاء 8',
        description: 'غطاء فتحة التفتيش هو صفيحة قابلة للإزالة تُشكِّل غطاءً لفتحة التفتيش، وهي نقطة الوصول إلى المرافق تحت الأرض مثل شبكات الصرف الصحي، ومصارف مياه الأمطار، والخزائن الكهربائية. يتم تصميمه لمنع سقوط أي شخص أو أي شيء داخل الفتحة ومنع الوصول غير المصرح به',
        price: 'X',
        imageUrl: '../../image/f20.png'
      },
      {
        name: 'غطاء 9',
        description: 'غطاء فتحة التفتيش هو صفيحة قابلة للإزالة تُشكِّل غطاءً لفتحة التفتيش، وهي نقطة الوصول إلى المرافق تحت الأرض مثل شبكات الصرف الصحي، ومصارف مياه الأمطار، والخزائن الكهربائية. يتم تصميمه لمنع سقوط أي شخص أو أي شيء داخل الفتحة ومنع الوصول غير المصرح به',
        price: 'X',
        imageUrl: '../../image/f21.png'
      },
      {
        name: 'غطاء 10',
        description: 'غطاء فتحة التفتيش هو صفيحة قابلة للإزالة تُشكِّل غطاءً لفتحة التفتيش، وهي نقطة الوصول إلى المرافق تحت الأرض مثل شبكات الصرف الصحي، ومصارف مياه الأمطار، والخزائن الكهربائية. يتم تصميمه لمنع سقوط أي شخص أو أي شيء داخل الفتحة ومنع الوصول غير المصرح به',
        price: 'X',
        imageUrl: '../../image/f22.png'
      },
      {
        name: 'غطاء 11',
        description: 'غطاء فتحة التفتيش هو صفيحة قابلة للإزالة تُشكِّل غطاءً لفتحة التفتيش، وهي نقطة الوصول إلى المرافق تحت الأرض مثل شبكات الصرف الصحي، ومصارف مياه الأمطار، والخزائن الكهربائية. يتم تصميمه لمنع سقوط أي شخص أو أي شيء داخل الفتحة ومنع الوصول غير المصرح به',
        price: 'X',
        imageUrl: '../../image/f23.png'
      }
    ],
    product4: [
      {
        name: 'بردات  1',
        description: 'الوصلة ذات الحافة هي نوع من الوصلات الميكانيكية المستخدمة لربط الأنابيب أو الخراطيم أو الأجسام الأسطوانية الأخرى. تتميز بحافة، وهي عبارة عن حافة مسطحة بارزة أو طوق يمتد من جسم الوصلة. تحتوي الحافة عادةً على ثقوب للبراغي أو المسامير، مما يسمح بتثبيت الوصلة بشكل آمن على سطح آخر، مثل حافة أنبوب، أو صمام، أو قطعة من الآلات.',
        price: 'X',
        imageUrl: '../../image/g1.png'
      },
      {
        name: 'بردات  2',
        description: 'الوصلة ذات الحافة هي نوع من الوصلات الميكانيكية المستخدمة لربط الأنابيب أو الخراطيم أو الأجسام الأسطوانية الأخرى. تتميز بحافة، وهي عبارة عن حافة مسطحة بارزة أو طوق يمتد من جسم الوصلة. تحتوي الحافة عادةً على ثقوب للبراغي أو المسامير، مما يسمح بتثبيت الوصلة بشكل آمن على سطح آخر، مثل حافة أنبوب، أو صمام، أو قطعة من الآلات.',
        price: 'x',
        imageUrl: '../../image/g2.png'
      },
      {
        name: 'بردات  3',
        description: 'الوصلة ذات الحافة هي نوع من الوصلات الميكانيكية المستخدمة لربط الأنابيب أو الخراطيم أو الأجسام الأسطوانية الأخرى. تتميز بحافة، وهي عبارة عن حافة مسطحة بارزة أو طوق يمتد من جسم الوصلة. تحتوي الحافة عادةً على ثقوب للبراغي أو المسامير، مما يسمح بتثبيت الوصلة بشكل آمن على سطح آخر، مثل حافة أنبوب، أو صمام، أو قطعة من الآلات.',
        price: 'x',
        imageUrl: '../../image/g3.png'
      }
    ],
    product5: [
      {
        name: 'مسلاب 1',
        description: 'هو وصلة أنابيب تُستخدم في أنظمة الأنابيب لربط أنبوبين بقطرين مختلفين. تسهل الانتقال السلس من أنبوب أكبر إلى أصغر (أو العكس)، مما يساعد على إدارة معدلات التدفق، والضغط، وديناميكية السوائل بشكل فعال. المخفضات ضرورية في الحفاظ على سلامة نظام الأنابيب وضمان نقل السوائل بكفاءة.',
        price: 'x',
        imageUrl: '../../image/f1.png'
      },
      {
        name: 'مسلاب 2',
        description: 'هو وصلة أنابيب تُستخدم في أنظمة الأنابيب لربط أنبوبين بقطرين مختلفين. تسهل الانتقال السلس من أنبوب أكبر إلى أصغر (أو العكس)، مما يساعد على إدارة معدلات التدفق، والضغط، وديناميكية السوائل بشكل فعال. المخفضات ضرورية في الحفاظ على سلامة نظام الأنابيب وضمان نقل السوائل بكفاءة.',
        price: 'x',
        imageUrl: '../../image/f3.png'
      }
    ],
    product6: [
      {
        name: 'مشترك 1',
        description: 'هو نوع من وصلات الأنابيب المستخدمة في أنظمة السباكة والأنابيب لربط ثلاثة أقسام من الأنابيب أو الأنابيب الصغيرة. يكون شكله مثل الحرف T ويسمح بتفرع نظام الأنابيب في اتجاهين، مكونًا تقاطعًا. تعتبر الوصلات الثلاثية أساسية في العديد من التطبيقات، بما في ذلك توزيع المياه، وخطوط أنابيب الغاز، ومعالجة المواد الكيميائية.',
        price: 'x',
        imageUrl: '../../image/p7.png'
      },
      {
        name: 'مشترك 2',
        description: 'هو نوع من وصلات الأنابيب المستخدمة في أنظمة السباكة والأنابيب لربط ثلاثة أقسام من الأنابيب أو الأنابيب الصغيرة. يكون شكله مثل الحرف T ويسمح بتفرع نظام الأنابيب في اتجاهين، مكونًا تقاطعًا. تعتبر الوصلات الثلاثية أساسية في العديد من التطبيقات، بما في ذلك توزيع المياه، وخطوط أنابيب الغاز، ومعالجة المواد الكيميائية.',
        price: 'x',
        imageUrl: '../../image/p5.png'
      },
      {
        name: 'مشترك 3',
        description: 'هو نوع من وصلات الأنابيب المستخدمة في أنظمة السباكة والأنابيب لربط ثلاثة أقسام من الأنابيب أو الأنابيب الصغيرة. يكون شكله مثل الحرف T ويسمح بتفرع نظام الأنابيب في اتجاهين، مكونًا تقاطعًا. تعتبر الوصلات الثلاثية أساسية في العديد من التطبيقات، بما في ذلك توزيع المياه، وخطوط أنابيب الغاز، ومعالجة المواد الكيميائية.',
        price: 'x',
        imageUrl: '../../image/p4.webp'
      },
      {
        name: 'مشترك 4',
        description: 'هو نوع من وصلات الأنابيب المستخدمة في أنظمة السباكة والأنابيب لربط ثلاثة أقسام من الأنابيب أو الأنابيب الصغيرة. يكون شكله مثل الحرف T ويسمح بتفرع نظام الأنابيب في اتجاهين، مكونًا تقاطعًا. تعتبر الوصلات الثلاثية أساسية في العديد من التطبيقات، بما في ذلك توزيع المياه، وخطوط أنابيب الغاز، ومعالجة المواد الكيميائية.',
        price: 'x',
        imageUrl: '../../image/p2.webp'
      },
      {
        name: 'مشترك 5',
        description: 'هو نوع من وصلات الأنابيب المستخدمة في أنظمة السباكة والأنابيب لربط ثلاثة أقسام من الأنابيب أو الأنابيب الصغيرة. يكون شكله مثل الحرف T ويسمح بتفرع نظام الأنابيب في اتجاهين، مكونًا تقاطعًا. تعتبر الوصلات الثلاثية أساسية في العديد من التطبيقات، بما في ذلك توزيع المياه، وخطوط أنابيب الغاز، ومعالجة المواد الكيميائية.',
        price: 'x',
        imageUrl: '../../image/p1.webp'
      }
    ],
    product7: [
      {
        name: 'ماسورة 1',
        description: 'هذه أنابيب أسطوانية تُستخدم لنقل السوائل (السوائل والغازات) من مكان إلى آخر. تُعتبر مكونات أساسية في مجموعة واسعة من الصناعات، بما في ذلك إمدادات المياه، ومعالجة مياه الصرف الصحي، والنفط والغاز، ومعالجة المواد الكيميائية، وأنظمة التدفئة والتهوية وتكييف الهواء (HVAC). تأتي الأنابيب بمختلف المواد والأحجام والمواصفات لتلبية احتياجات التطبيقات المختلفة.',
        price: 'x',
        imageUrl: '../../image/p9.png'
      },
      {
        name: 'ماسورة 2',
        description: 'هذه أنابيب أسطوانية تُستخدم لنقل السوائل (السوائل والغازات) من مكان إلى آخر. تُعتبر مكونات أساسية في مجموعة واسعة من الصناعات، بما في ذلك إمدادات المياه، ومعالجة مياه الصرف الصحي، والنفط والغاز، ومعالجة المواد الكيميائية، وأنظمة التدفئة والتهوية وتكييف الهواء (HVAC). تأتي الأنابيب بمختلف المواد والأحجام والمواصفات لتلبية احتياجات التطبيقات المختلفة.',
        price: 'x',
        imageUrl: '../../image/p10.png'
      },
      {
        name: 'ماسورة 3',
        description: 'هذه أنابيب أسطوانية تُستخدم لنقل السوائل (السوائل والغازات) من مكان إلى آخر. تُعتبر مكونات أساسية في مجموعة واسعة من الصناعات، بما في ذلك إمدادات المياه، ومعالجة مياه الصرف الصحي، والنفط والغاز، ومعالجة المواد الكيميائية، وأنظمة التدفئة والتهوية وتكييف الهواء (HVAC). تأتي الأنابيب بمختلف المواد والأحجام والمواصفات لتلبية احتياجات التطبيقات المختلفة.',
        price: 'x',
        imageUrl: '../../image/p11.png'
      },
      {
        name: 'ماسورة 4',
        description: 'هذه أنابيب أسطوانية تُستخدم لنقل السوائل (السوائل والغازات) من مكان إلى آخر. تُعتبر مكونات أساسية في مجموعة واسعة من الصناعات، بما في ذلك إمدادات المياه، ومعالجة مياه الصرف الصحي، والنفط والغاز، ومعالجة المواد الكيميائية، وأنظمة التدفئة والتهوية وتكييف الهواء (HVAC). تأتي الأنابيب بمختلف المواد والأحجام والمواصفات لتلبية احتياجات التطبيقات المختلفة.',
        price: 'x',
        imageUrl: '../../image/p12.webp'
      },
      {
        name: 'ماسورة 5',
        description: 'هذه أنابيب أسطوانية تُستخدم لنقل السوائل (السوائل والغازات) من مكان إلى آخر. تُعتبر مكونات أساسية في مجموعة واسعة من الصناعات، بما في ذلك إمدادات المياه، ومعالجة مياه الصرف الصحي، والنفط والغاز، ومعالجة المواد الكيميائية، وأنظمة التدفئة والتهوية وتكييف الهواء (HVAC). تأتي الأنابيب بمختلف المواد والأحجام والمواصفات لتلبية احتياجات التطبيقات المختلفة.',
        price: 'x',
        imageUrl: '../../image/p13.png'
      }
    ],
    product8: [
      {
        name: 'حنفية حريق',
        description: 'هي أدوات تستخدم لتوفير مصدر مياه لمكافحة الحرائق. يتم تثبيتها عادةً على شبكات المياه العامة في الشوارع والأماكن العامة لتكون جاهزة للاستخدام من قبل رجال الإطفاء في حالة حدوث حريق. تُعتبر جزءًا مهمًا من أنظمة مكافحة الحرائق في المناطق الحضرية',
        price: 'x',
        imageUrl: '../../image/f5.png'
      },
      {
        name: 'حنفية حريق 2',
        description: 'هي أدوات تستخدم لتوفير مصدر مياه لمكافحة الحرائق. يتم تثبيتها عادةً على شبكات المياه العامة في الشوارع والأماكن العامة لتكون جاهزة للاستخدام من قبل رجال الإطفاء في حالة حدوث حريق. تُعتبر جزءًا مهمًا من أنظمة مكافحة الحرائق في المناطق الحضرية',
        price: 'x',
        imageUrl: '../../image/f6.png'
      },
      {
        name: 'حنفية حريق 3',
        description: 'هي أدوات تستخدم لتوفير مصدر مياه لمكافحة الحرائق. يتم تثبيتها عادةً على شبكات المياه العامة في الشوارع والأماكن العامة لتكون جاهزة للاستخدام من قبل رجال الإطفاء في حالة حدوث حريق. تُعتبر جزءًا مهمًا من أنظمة مكافحة الحرائق في المناطق الحضرية',
        price: 'x',
        imageUrl: '../../image/f13.png'
      },
      {
        name: 'حنفية حريق 4',
        description: 'هي أدوات تستخدم لتوفير مصدر مياه لمكافحة الحرائق. يتم تثبيتها عادةً على شبكات المياه العامة في الشوارع والأماكن العامة لتكون جاهزة للاستخدام من قبل رجال الإطفاء في حالة حدوث حريق. تُعتبر جزءًا مهمًا من أنظمة مكافحة الحرائق في المناطق الحضرية',
        price: 'x',
        imageUrl: '../../image/f14.png'
      }
    ]
    // Add other product sections here
  };

  const displayProducts = (products) => {
    const productContainer = document.getElementById('productContainer');
    productContainer.innerHTML = products.map(product => `
      <div class="col mb-4 justify-content-sm-between">
      <center>
        <div class="card">
          <img src="${product.imageUrl}" class="card-img-top" alt="${product.name}">
          <div class="card-body ">
            <h5 class="card-title">${product.name}</h5>
            <p class="card-text non-show">${product.description}</p>
            <p class="card-text"><strong>Price: <a href="contact.html">Show here</a></strong></p>
            <button class="btn btn-primary btn-sm" onclick="showProductDetails('${product.name}', '${product.description}', '${product.price}', '${product.imageUrl}')">Details</button>
          </div>
        </div>
        </center>
      </div>
    `).join('');
  };

  const showProductDetails = (name, description, price, imageUrl) => {
    const modal = document.getElementById('myModal');
    const modalImage = document.getElementById('modalImage');
    const modalTitle = document.getElementById('modalTitle');
    const modalDescription = document.getElementById('modalDescription');
    const modalPrice = document.getElementById('modalPrice');

    modalImage.src = imageUrl;
    modalTitle.textContent = name;
    modalDescription.textContent = description;
    modalPrice.textContent = ``;

    modal.style.display = 'block';
  };

  // Close the modal when the user clicks the close button or outside of the modal content
  window.onclick = function(event) {
    const modal = document.getElementById('myModal');
    if (event.target === modal) {
      modal.style.display = 'none';
    }
  };

  document.getElementsByClassName('close')[0].onclick = function() {
    const modal = document.getElementById('myModal');
    modal.style.display = 'none';
  };
  document.getElementById('btnProduct1').addEventListener('click', () => {
    displayProducts(productSections.product1);
  });
  document.getElementById('btnProduct2').addEventListener('click', () => {
    displayProducts(productSections.product2);
  });
  document.getElementById('btnProduct3').addEventListener('click', () => {
    displayProducts(productSections.product3);
  });
  document.getElementById('btnProduct4').addEventListener('click', () => {
    displayProducts(productSections.product4);
  });
  document.getElementById('btnProduct5').addEventListener('click', () => {
    displayProducts(productSections.product5);
  });
  document.getElementById('btnProduct6').addEventListener('click', () => {
    displayProducts(productSections.product6);
  });
  document.getElementById('btnProduct7').addEventListener('click', () => {
    displayProducts(productSections.product7);
  });
  document.getElementById('btnProduct8').addEventListener('click', () => {
    displayProducts(productSections.product8);
  });

  // Initial display
  // displayProducts(productSections.product1);

  // Function to get query parameters
function getQueryParams() {
  const params = new URLSearchParams(window.location.search);
  return params.get('product');
}

// When the page loads, check for a product query parameter and display the product
window.onload = function() {
  const productKey = getQueryParams();
  if (productKey && productSections[productKey]) {
      displayProducts(productSections[productKey]);
  }
};